// 비고 : (프로그램 기초 사용 권장 툴입니다.)
/*
-----권장사항-----
(가독성 좋게 핵심만.)

-----유의점-----
(가독성 좋게 핵심만.
변경 권장 내용 (안에) 단, 쓸떄는 지우고)
*/

// 주 내용(코드)
#include <stdio.h>

int main(void)
{
    printf("hello world\n");
    return 0;
}

/*
-----총평-----
한줄 평 : (프로그램 기초 사용 권장 툴)

세줄 평 : (프로그램 기초 사용 권장 툴이다.
아직 이렇다할 내용은 없다.
다만 앞으로 이걸 추가하며 더 편하게 쓸수있다.)

다줄 평 : (프로그램 기초 사용 권장 툴이다.
아직 이렇다할 내용은 없다.
다만 앞으로 이걸 추가하며 더 편하게 쓸수있다.
C언어에 사용된다.)

-----추가 권장 내용-----
(이 코드는 아직 비어 있습니다.
어떻게 채워 나갈지 당신의 자유입니다!)

-----세부-----
(이 코드는 아직 완전히 비어 있습니다.
어떻게 채워 나갈지 당신만의 자유입니다!)

-----1차 추가 내용-----
(기본 main, return추가)

-----마지막(N)차 추가 내용-----
(총평, 비고등 기본 주석추가)
*/