# 기초적으로 2개의 프로그램이 필요합니다.
'''바로 비주얼 스튜디오 코드(visual studio code)와
파이썬 입니다. 파이썬이 초보자 입문용으로 가장 쉬운 언어 입니다.'''

## 주의 사항 ##
'''비주얼 스튜디오는 여러가지가 있습니다.
특히 저희가 사용할 프로그램은 '보라색'이 아닌
:파란색:입니다.'''

# 찾기 힘들다면 "비쥬얼 스튜디오 코드"라고 구글에 검색해보세요.

# 다음으로 파이썬도 마찬가지입니다. 최신버전으로 설치해주세요.

## 배울 내용.
'''꽤나 많습니다.
제가 최대한 정리해서 주기는 할테지만
잘 따라가다 훅 놓치기 쉽상입니다.
적어도 이해가 안되는 부분은 질문해주세요.'''
# 파이썬의 기본적인 명령어
# if, 반복문, 연산자, 비교, 파일/ 함수, // 클래스, 리스트,
'''앞 5개는 게임제작에 필수적인 부분입니다. 적어도 여기 만큼은 들어주세요.'''

'''---------------------------------------'''
# 거의 모든 파이썬 프로그램에서 사용하는 기본 명령어 입니다.
# 수학 +-만큼 코딩에서 중요한 역할입니다.


# 기초 명령어
# 변수 선언이라 부르는 명령어가 있습니다.
# 개념만 알아두시고 명령어 구조만 아시면 됩니다.


### 기본적인 구조

변수이름 = 1
변수_이름 = '글자'

### 알면 좋지만 몰라도 상관 없음

'''여기서 주의사항 몇가지!
1. 뛰어쓰기가 안된다.
(뛰어쓰기 대용 '_')

2. 같은 이름으로 여러번 사용하면 마지막걸로 저장된다.
(쉽게 상자를 만들고 이름과 내용물을 넣는것!)

3. 대부분의 특수기호는 피하자!
(!@#$%^&*()-+=같은 특수기호는 당연히 안된다.)

4. 글자는 따옴표를 써야한다.
(예외 : True, Flase 등 특수한 역할을 가진 글자들)

5. True, Flase 등 특수한 역할을 가진 글자들또한 쓰면 안된다!'''


'''--------------------------------------'''
# 저희가 또 사용할 명령어는 print()입니다.
# 단순히 명령어가 잘 작동되는지만 확인하는 용도입니다.

# 이렇게 바로 적어 넣거나
print(1)
print('안녕하세요')
print("예시문입니다")

# 다만 글자를 입력할때 따옴표를 반드시 사용해주세요.
# 또, print뒤에 가로(안에) 넣어야 작동합니다.

변수이름 = 99
변수_이름 = '예시'

# 아니면 이렇게 위에서 지정한 변수를 사용할수도 있습니다.
print(변수이름)
print(변수_이름)


'''------------------------'''


# 권장 준비물입니다.
# usb / 많아봐야 10MB사용 합니다.